# Brewfile: Homebrew package manager configuration

# Homebrew taps for additional repositories and services
tap "homebrew/bundle"        # Enables usage of Brewfile for managing packages
tap "homebrew/services"      # Allows managing services like Redis, PostgreSQL, etc.

### Security and Cryptography Libraries ###
brew "openssl@3"             # OpenSSL library for secure communication
brew "libressl"              # Alternative to OpenSSL, focused on modern security practices
brew "gnutls"                # GNU's TLS library for secure communication
brew "mbedtls"               # Lightweight TLS library for cryptography

### Text and Rendering Libraries ###
brew "libass"                # Subtitle rendering library
brew "harfbuzz"              # OpenType text shaping engine
brew "pango"                 # Text layout and rendering library

### Document Processing Libraries ###
brew "poppler"               # PDF rendering library
brew "icu4c@76"              # Unicode and globalization support library

### Networking Libraries ###
brew "libmicrohttpd"         # Lightweight HTTP server library
brew "librist"               # Reliable Internet Stream Transport protocol

### Development Tools ###
brew "llvm"                  # Compiler infrastructure
brew "python@3.13"           # Latest Python version for development
brew "python-tk@3.13"        # Tkinter toolkit for Python GUI development
brew "node@20"               # JavaScript runtime for building applications
brew "awscli"                # Command-line tool for AWS management
brew "bash"                  # Bourne Again Shell (Bash)
brew "nano"                  # Lightweight text editor
brew "tree"                  # Directory tree viewer

### Databases and Caching ###
brew "redis"                 # In-memory key-value store

### Multimedia and Image Tools ###
brew "imagemagick"           # Image manipulation library
brew "ffmpeg"                # Multimedia framework for processing audio and video
brew "tesseract"             # OCR (Optical Character Recognition) engine
brew "audacity"              # Audio editing software
brew "exiftool"              # Tool for reading, writing, and editing metadata in images and files

### Networking and Download Tools ###
brew "wget"                  # Utility for non-interactive network downloads
brew "yt-dlp"                # YouTube and video downloader
brew "arp-scan"              # Tool for discovering and fingerprinting IP hosts
brew "arping"                # Find if an IP is 'taken' and identify the MAC address
brew "transmission"          # BitTorrent client for downloading files

### Privacy and Anonymity Tools ###
brew "proxychains-ng"        # Redirect TCP traffic through proxies
brew "privoxy"               # Non-caching web proxy with advanced filtering
brew "tor"                   # Onion routing protocol for anonymous communication
brew "torsocks"              # Safely torify applications
cask "little-snitch"         # Network monitoring and control software
cask "tunnelblick"           # OpenVPN client for secure network connections

### Security and Penetration Testing Tools ###
brew "ffuf"                  # Fuzzing tool for discovering hidden directories/files on web servers
brew "gobuster"              # Directory and DNS brute-forcing tool
brew "sqlmap"                # Automated SQL injection detection and exploitation tool
brew "semgrep"               # Static code analysis tool for finding vulnerabilities
brew "john"                  # Password-cracking tool (John the Ripper)
brew "nikto"                 # Web server vulnerability scanner
brew "nmap"                  # Network discovery and security auditing tool
brew "gnupg"                 # GNU Privacy Guard for secure encryption and signing
brew "gpgme"                 # GPG Made Easy, library for interacting with GPG
brew "testssl"               # Check server's SSL/TLS configurations
brew "sslscan"               # Discover supported SSL/TLS cipher suites

### GUI Applications (Casks) ###

#### Development Tools ####
cask "docker"                # Platform for developing, shipping, and running containers
cask "drawio"                # Diagram creation tool for designing flowcharts and diagrams
cask "nova"                  # Lightweight code editor by Panic
cask "pycharm-ce"            # PyCharm Community Edition, an IDE for Python development
cask "tableplus"             # Modern GUI tool for database management
cask "webstorm"              # JavaScript IDE by JetBrains for web development
cask "sublime-text"          # Text editor for programming and markup
cask "sublime-merge"         # Git client with a clean and intuitive interface
cask "rapidapi"              # API testing and management tool


#### Communication and Collaboration ####
cask "discord"               # Communication platform for text, voice, and video chat
cask "mattermost"            # Team collaboration and messaging tool
cask "microsoft-teams"       # Video conferencing and collaboration tool by Microsoft
cask "slack"                 # Team messaging and productivity tool
cask "skype"                 # Video calling and messaging application
cask "telegram"              # Secure messaging app with cloud synchronization
cask "whatsapp"              # Messaging app for personal and group chats
cask "zoom"                  # Video conferencing and online meetings platform

#### Productivity ####
cask "adobe-acrobat-reader"  # PDF reader from Adobe for viewing and editing PDF files
cask "the-unarchiver"        # Simple tool for extracting various archive formats
cask "transmit"              # File transfer client for macOS
cask "google-chrome"         # Popular web browser by Google
cask "firefox-developer-edition" # Developer edition of Firefox browser

### Shell Enhancements ###
brew "bash-completion"       # Bash autocompletion for commands
brew "docker-completion"     # Bash autocompletion for Docker commands
brew "docker-compose-completion" # Bash autocompletion for Docker Compose commands
brew "docker-machine-completion" # Bash autocompletion for Docker Machine commands

#### Multimedia and Entertainment ####
cask "spotify"               # Music streaming platform
cask "steam"                 # Digital distribution platform for games and software
cask "vlc"                   # Open-source media player
cask "obs"                   # Open Broadcaster Software for video recording and live streaming
cask "openttd"               # Open-source transport simulation game

### Quick Look Plugins ###
cask "qlcolorcode"           # Syntax highlighting in Quick Look for source code
cask "qlmarkdown"            # Markdown rendering in Quick Look
cask "qlstephen"             # Preview plain text files without extensions in Quick Look
cask "quicklook-json"        # JSON formatting and syntax highlighting in Quick Look

#### Virtualization ####
cask "virtualbox"            # Virtualization platform for running multiple OSs
cask "vnc-viewer"            # Remote desktop software for accessing other computers
